from shared.service_init import init_service

# 初始化服务
service_init = init_service("welding1_k2")

# 导出配置和日志
config = service_init.config
logger = service_init.logger
service_name = service_init.service_name
# [复位]
# 1=油桶需放到指定位置
# 2=焊枪需放到指定位置
# 3=搭铁线需放到指定位置
# 4=总开关需处于关闭状态
# 5=漏电保护开关需处于关闭状态
# 6=焊机开关需处于关闭状态

# [实操]
# 1=排除危险源
# 2=检查一次线

# 3=检查二次线
# 4=检查焊枪接地夹

# 5=检查焊机
# 6=检查焊机接地线


# 7=打开总开关
# 8=打开漏电保护开关
# 9=打开焊机开关
# 10=夹好接地夹

# 11=开关操作动作规范


# 12=摆放焊件
# 13=试焊
# 14=焊接作业

# 15=取下接地夹
# 16=关闭焊机开关
# 17=关闭漏电保护开关
# 18=关闭总开关

# 19=关闭操作动作规范
# 20=清除焊渣
# 21=检查考件


# 22=焊后场地清理
# 23=焊枪复位
# 24=接地夹复位